# Title Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
View..::..Title Property
View Class See Also
---
The view title. This consists of the view name plus other modifiers, such as the view type, sheet number, area scheme, and/or assembly type, depending on the specifics of the view.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public string Title { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Title As String
	Get
```

Visual C++
---
```text
public:
property String^ Title {
	String^ get ();
}
```

# See Also
View Class
Autodesk.Revit.DB Namespace